{
  "pdf_id": "8adb3ef3-cfaf-469e-878b-1e90a728ea1d",
  "filename": "8adb3ef3-cfaf-469e-878b-1e90a728ea1d_Siddhant-Hulle-Resume.pdf",
  "uploaded_at": 1763571769,
  "num_chunks": 1,
  "chunks": [
    "Siddhant Hulle\nsidhulle108@gmail.com 9119413403 Sangli,India www.linkedin.com/in/siddhant-hulle github.com/Siddh1112002 \nPROFILE\nAspiring Software Engineer with expertise in designing and implementing scalable, full-stack solutions. Proficient in key technologies like CPP, \nPython, Java, MERN stack, and cloud deployment strategies. Skilled in API development, microservices, and database management with a proven \nrecord of building user-centric solutions, optimizing performance, and delivering results. Dedicated to problem-solving, collaborating across teams, \nand leveraging cutting-edge tools to develop impactful, business-aligned software applications.\nEDUCATION\nBachelor of Technology in Computer Science and Engineering\nAnnasaheb Dange College of Engineering and Technology\nCPI - 8.3112/2021 – 07/2025\nAshta, India\nHigher Secondary School\nSangli Highschool and Junior College, Sangli\nPercentage - 89.8306/2020 – 08/2021\nSangli, India\nPROJECTS\n1. LMS E-Learning Platform\nDeveloped a full-stack e-learning platform tailored for instructors and learners, offering a seamless experience with \nthe following features:10/2024 – 12/2024\n•Designed a secure user authentication system using Node.js and MongoDB.\n•Engineered course management functionalities (creation, deletion, publishing) for instructors.\n•Integrated Stripe API for secure payments and subscription-based content access.\n•Optimized state management with Redux and styled interfaces with Tailwind CSS.\n•Technologies Used: MERN Stack (MongoDB, Express.js, React.js, Node.js), Redux, Stripe API, Tailwind CSS\n2. AI Mock Interview\nBuilt an AI-powered platform for mock interviews with real-time feedback and analyses.02/2024 – 03/2024\n•Implemented strong, user-specific authentication via Clerk API.\n•Integrated Google Gemini AI for customizable AI interview scenarios and Text-to-Speech feedback.\n•Engineered real-time progress tracking through Firebase backend services.\n•Delivered an adaptive, responsive UI using React.js, TypeScript, and Shadcn UI.\n•Technologies Used: React.js, TypeScript, Shadcn UI, Clerk, Google Gemini AI, Firebase\n3. Real-Time Code Editor\nCreated an innovative, full-stack collaborative code editor enabling multiple users to edit in real-time.03/2023 – 07/2023\n•Implemented synchronization for concurrent users using Socket.io and Express.js.\n•Designed an interactive frontend with React.js, ensuring a seamless user experience.\n•Deployed the solution successfully on Heroku for public accessibility.\n•Technologies Used: React.js, Node.js, Express.js, Socket.io, Heroku\nINTERNSHIPS\nAI-ML Virtual Internship — AICTE\n•Built advanced machine learning pipelines and applied concepts of supervised learning to real-world problems.01/2025 – 03/2025\nAI-ML with Data Science Internship — Ybi Foundation\n•Designed end-to-end data preprocessing and feature engineering workflows using Python.12/2024 – 01/2025\nSKILLS\nProgramming Languages :  C++, C, Python, Java\nWeb Development: HTML, CSS, JavaScript, React.js, Node.js, Express.js , RESTful API\nDatabase Management and Version Control : MongoDB, SQL, Git, GitHub.\nSoft Skills : Analytical Problem Solving, Team Collaboration, Effective Communication, Time Management.\nCERTIFICATES\nJAVA Programming (Udemy)\nC++ Programming : Beginners to Advanced for Developers (Udemy)Complete Python Bootcamp (Udemy)\nInfosys (Springboard) : HTML5,CSS3,JavaScript"
  ]
}